{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 400], "dtype": "float32", "sparse": false, "name": "input_39"}, "inbound_nodes": [], "name": "input_39"}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.5, "trainable": true, "name": "dropout_123", "noise_shape": null}, "inbound_nodes": [[["input_39", 0, 0, {}]]], "name": "dropout_123"}, {"class_name": "Dense", "config": {"units": 150, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "name": "dense_161"}, "inbound_nodes": [[["dropout_123", 0, 0, {}]]], "name": "dense_161"}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.5, "trainable": true, "name": "dropout_124", "noise_shape": null}, "inbound_nodes": [[["dense_161", 0, 0, {}]]], "name": "dropout_124"}, {"class_name": "Dense", "config": {"units": 200, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "name": "dense_162"}, "inbound_nodes": [[["dropout_124", 0, 0, {}]]], "name": "dense_162"}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.5, "trainable": true, "name": "dropout_125", "noise_shape": null}, "inbound_nodes": [[["dense_162", 0, 0, {}]]], "name": "dropout_125"}, {"class_name": "Dense", "config": {"units": 300, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "name": "dense_163"}, "inbound_nodes": [[["dropout_125", 0, 0, {}]]], "name": "dense_163"}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.5, "trainable": true, "name": "dropout_126", "noise_shape": null}, "inbound_nodes": [[["dense_163", 0, 0, {}]]], "name": "dropout_126"}, {"class_name": "Dense", "config": {"units": 150, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "name": "dense_164"}, "inbound_nodes": [[["dropout_126", 0, 0, {}]]], "name": "dense_164"}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.5, "trainable": true, "name": "dropout_127", "noise_shape": null}, "inbound_nodes": [[["dense_164", 0, 0, {}]]], "name": "dropout_127"}, {"class_name": "Dense", "config": {"units": 1, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "sigmoid", "name": "dense_165"}, "inbound_nodes": [[["dropout_127", 0, 0, {}]]], "name": "dense_165"}], "output_layers": [["dense_165", 0, 0]], "name": "model_66", "input_layers": [["input_39", 0, 0]]}, "keras_version": "2.2.2", "backend": "tensorflow"}